; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	image1 - mode
	image3 - mode
	thermograph0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation9 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 image3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star8)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation10)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 GroundStation6)
	(supports instrument8 image3)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite3 GroundStation6)
	(have_image Planet11 image3)
	(have_image Phenomenon12 image1)
	(have_image Planet13 image3)
	(have_image Star14 image3)
	(have_image Star15 image1)
	(have_image Planet16 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation6)
   goals met: 1 of 7
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 7
3. (calibrate satellite2 instrument5 groundstation6)
   added: (calibrated instrument5)
   goals met: 1 of 7
4. (turn_to satellite2 planet16 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 planet16)
   goals met: 1 of 7
5. (take_image satellite2 planet16 instrument5 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 2 of 7
6. (turn_to satellite2 phenomenon12 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 7
7. (turn_to satellite0 groundstation5 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon12 instrument5 image1)
   added: (have_image phenomenon12 image1)
   goals met: 3 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
10. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 3 of 7
11. (turn_to satellite0 planet11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet11)
   goals met: 3 of 7
12. (take_image satellite0 planet11 instrument0 image3)
   added: (have_image planet11 image3)
   goals met: 4 of 7
13. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 4 of 7
14. (take_image satellite0 planet13 instrument0 image3)
   added: (have_image planet13 image3)
   goals met: 5 of 7
15. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 5 of 7
16. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 6 of 7
17. (turn_to satellite2 star15 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star15)
   goals met: 6 of 7
18. (take_image satellite2 star15 instrument5 image1)
   added: (have_image star15 image1)
   goals met: 7 of 7
